Core/src/DataProcessors/ЗаполнениеРеквизитовПланаСчетовХозрасчетный/ЗаполнениеРеквизитовПланаСчетовХозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеРеквизитовПланаСчетовХозрасчетный</name>
</mdclass:DataProcessor>

Core/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Вспомогательный</name>
      <description>Вспомогательный счет</description>
      <code>0000   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПереводыВПути</name>
      <description>Переводы в пути</description>
      <code>1290   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыПоАвансамВыданным</name>
      <description>Расчеты по авансам выданным</description>
      <code>1480   </code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>1610   </code>
    </items>
    <items>
      <name>ПоставляемыеМатериалы</name>
      <description>გადაცემული მარაგები</description>
      <code>1629      </code>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчиками</description>
      <code>3100   </code>
      <accountType>Passive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками</description>
        <code>3110   </code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>НалоговыеОбязательства</name>
      <description>გადასახდელი დღგ</description>
      <code>3330   </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НалоговыеОбязательства_1</name>
      <description>გადასახდელი დღგ (/1)</description>
      <code>3330/1    </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НачисленныйНДСНаПолученныйАванс</name>
      <description>მიღებულ ავანსზე დარიცხული დღგ</description>
      <code>3331   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПредворительныйЗачетПолученныйНаВыдааныАванс</name>
      <description>გაცემულ ავანსზე მიღებული წინასწარი ჩათვლა</description>
      <code>3332   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>НДС</name>
      <description>გადახდილი დღგ</description>
      <code>3340   </code>
    </items>
    <items>
      <name>НДС_1</name>
      <description>გადახდილი დღგ (/1)</description>
      <code>3340/1    </code>
    </items>
    <items>
      <name>ОплаченныеКОплатеНДСНаАванс</name>
      <description>ავანსზე გადახდილი/გადასახდელი დღგ</description>
      <code>3341   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ЗачетПолученногоНДСНаВыданныАванс</name>
      <description>გაცემულ ავანსის თანხებზე მიღებული დღგ-ს ჩათვლა</description>
      <code>3342   </code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБыстрогоВыбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетАналогУУ</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>EnumRef.ТипыСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределения</name>
    <type>
      <types>EnumRef.БазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗакрытия</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходовИРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyMapping</name>
    <type>
      <types>CatalogRef.AzRyMapping</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>НалоговыйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Core/src/DataProcessors/ЗаполнениеРеквизитовПланаСчетовХозрасчетный/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК СчетХозрасчетного,
		|	Хозрасчетный.СчетАналогУУ.ТипСчета КАК ТипСчета,
		|	Хозрасчетный.СчетАналогУУ.СпособРаспределения КАК СпособРаспределения,
		|	Хозрасчетный.СчетАналогУУ.СчетЗакрытия КАК СчетЗакрытия,
		|	Хозрасчетный.СчетАналогУУ.АналитикаДоходовИРасходов КАК АналитикаДоходовИРасходов
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный";
	
	тзРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	КоличествоОбходов = тзРезультатЗапроса.Количество();
	Инд = 0;
	Для Каждого Строк Из тзРезультатЗапроса Цикл
		
		СчетОбъект = Строк.СчетХозрасчетного.ПолучитьОбъект();
		
		ЗаполнитьЗначенияСвойств(СчетОбъект, Строк);
		
		Попытка
			СчетОбъект.Записать();
		Исключение
			Сообщить(НСтр("ru = 'Не заполнить счет: "+Строк.СчетХозрасчетного+"'; ka = 'Не заполнить счет: "+Строк.СчетХозрасчетного+"'"));
		КонецПопытки;
		
		Индикатор = Инд*100/КоличествоОбходов;
		Инд = Инд + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
